{
  "results": [
    {
      "input": "Gaming Podcasts - Find all major gaming podcasts including general, platform-specific (PC, console, mobile), retro gaming podcasts, and podcast directories",
      "output": {
        "topic_category": "Gaming Podcasts",
        "total_sources_found": 20,
        "top_sources": "Giant Bombcast | Followers: N/A | Platform: General Gaming\nDescription: Discusses the latest video game news and new releases, taste-test questionable beverages, and get wildly off-topic.\n\nKinda Funny Games Daily: Video Games News Podcast | Followers: N/A | Platform: Multi-platform/General Gaming\nDescription: World’s most popular daily video game news podcast covering the latest in PlayStation, Xbox, Nintendo and all of gaming.\n\nPodcast Beyond - IGN's PlayStation Show | Followers: N/A | Platform: Platform-specific (PlayStation)\nDescription: IGN’s flagship PlayStation show, breaking down all the latest Sony news and announcements.\n\nPodcast Unlocked | Followers: N/A | Platform: Platform-specific (Xbox)\nDescription: IGN's source for everything Xbox.\n\nRetronauts | Followers: Facebook 4.7K, Twitter 18.6K | Platform: Retro Gaming\nDescription: The original classic gaming podcast continues its endless quest to explore the history of video games, one game at a time.\n\nRetroRGB | Followers: Facebook 2.5K, Twitter 27.2K | Platform: Retro Gaming\nDescription: Retro-gaming news, interviews, nerdversations and more!.",
        "platform_breakdown": "General: 7, PlayStation: 1, Niche/Regional: 1, Nintendo: 1, Xbox: 1, Retro: 9",
        "key_insights": "The gaming podcast landscape is dominated by long-running shows from major outlets like Giant Bomb and IGN, with many of the top-rated podcasts having started over a decade ago. There is a strong segmentation by platform, with dedicated shows for PlayStation, Xbox, and Nintendo, but the most numerous category is the highly active and passionate Retro Gaming community. Follower data is inconsistent across sources, but the most prominent shows often have tens of thousands of followers across social media platforms."
      },
      "error": ""
    },
    {
      "input": "Gaming News Channels - Find all major gaming news websites, YouTube channels, and outlets covering gaming news, reviews, and updates",
      "output": {
        "topic_category": "Gaming News Channels and Outlets",
        "total_sources_found": 8,
        "top_sources": "IGN | ~19.6M Subscribers (YouTube), ~10.7M Followers (X/Twitter) | Multi-Platform | Global leader in video game and entertainment news, reviews, and guides.\nGameSpot | ~5.65M Subscribers (YouTube), ~4.5M Followers (X/Twitter) | Multi-Platform | Known for comprehensive video game reviews, news, and video content.\nPolygon | ~1.4M Subscribers (YouTube), ~1.1M Followers (X/Twitter) | Multi-Platform | Focuses on video games, culture, and entertainment with a distinct editorial voice.\nGame Informer | ~745K Subscribers (YouTube), ~656K Followers (Facebook) | Multi-Platform | A long-running source, originally a print magazine, known for in-depth previews and features.\nSkill Up | ~1.07M Subscribers (YouTube) | YouTube | Independent creator known for detailed, consumer-centric reviews and industry commentary.\nACG (AngryCentaurGaming) | ~1.21M Subscribers (YouTube) | YouTube | Independent reviewer famous for his in-depth, \"Buy, Wait for Sale, Rent, or Never Touch\" review format.\nGamesRadar+ | ~937K Followers (X/Twitter), ~1.3M Followers (Facebook) | Multi-Platform | Covers games, movies, TV, and comics, aiming to \"upgrade your downtime.\"\nVideo Games Chronicle (VGC) | ~113K Followers (X/Twitter) | Website/X/Twitter | Expert source for daily exclusive news, insight, and critique, often breaking industry stories.",
        "platform_breakdown": "Websites: 6, YouTube: 5, X/Twitter: 4, Facebook: 2, Instagram: 2",
        "key_insights": "The gaming news landscape is dominated by large, established multi-platform outlets like IGN and GameSpot, which command massive audiences across their websites and YouTube channels. A significant trend is the rise of influential, independent YouTube creators like Skill Up and ACG, who offer consumer-focused reviews and commentary, challenging the traditional media's dominance. The primary platforms for news consumption are dedicated websites and YouTube, with X/Twitter serving as a major real-time news and discussion hub."
      },
      "error": ""
    },
    {
      "input": "Gaming Leak Channels - Find all major sources for gaming leaks and rumors including Reddit communities, Discord servers, YouTube channels, and other platforms",
      "output": {
        "topic_category": "Gaming Leak Channels",
        "total_sources_found": 10,
        "top_sources": "Jason Schreier: ~395k followers on X/Twitter - Reporter for Bloomberg News, known for in-depth investigative journalism and breaking major industry news.\nTom Henderson: ~281k followers on X/Twitter - Founder of Insider Gaming, frequently leaks information on Call of Duty, Battlefield, and other AAA titles.\nJeff Grubb: ~130k followers on X/Twitter - Reporter for Giant Bomb, known for his predictions and insider information on various gaming topics.\nShiina: ~1.8M followers on X/Twitter - Prominent Fortnite leaker, known for accurate leaks on upcoming content and events.\nHypeX: ~4.1M followers on X/Twitter - Another major Fortnite leaker, providing updates on new skins, weapons, and map changes.\nNateTheHate: ~46k followers on X/Twitter - Known for leaks and rumors related to Nintendo and other Japanese developers.\nr/GamingLeaksAndRumours: 534k members on Reddit - The largest subreddit dedicated to gaming leaks and rumors, serving as a central hub for the community.\nGaming Leaks and Rumours Discord: ~4.2k members - The official Discord server for the r/GamingLeaksAndRumours subreddit.\nGameranx: 8.2M subscribers on YouTube - A popular gaming news channel that often covers leaks and rumors in their videos.\nThe Know: 1.3M subscribers on YouTube - A gaming news channel by Rooster Teeth that has a history of breaking exclusive leaks.",
        "platform_breakdown": "X/Twitter: 6, Reddit: 1, Discord: 1, YouTube: 2",
        "key_insights": "X/Twitter is the primary platform for individual leakers to disseminate information quickly, with major figures like HypeX and Shiina commanding millions of followers, particularly for games like Fortnite. Reddit serves as a crucial central hub and aggregator, with the r/GamingLeaksAndRumours community being the largest and most influential. The most reliable leakers, such as Jason Schreier and Tom Henderson, are typically established journalists or industry insiders, while dedicated YouTube channels like Gameranx and The Know provide broader coverage of leaks and rumors."
      },
      "error": ""
    },
    {
      "input": "Gaming Reddit Communities - Find all major gaming-related subreddits including general gaming, platform-specific, game suggestions, free games, and leaks",
      "output": {
        "topic_category": "Gaming Reddit Communities",
        "total_sources_found": 997,
        "top_sources": "Name: /r/gaming | Followers: 47,000,000 | Platform: Reddit | Description: The largest general gaming community on Reddit, covering all platforms and topics.\nName: /r/NintendoSwitch | Followers: 6,000,000 | Platform: Reddit | Description: The central hub for all news, discussion, and media about the Nintendo Switch.\nName: /r/pcgaming | Followers: 3,900,000 | Platform: Reddit | Description: Discussions, news, and media related to PC gaming.\nName: /r/PS5 | Followers: 2,800,000 | Platform: Reddit | Description: The official subreddit for the PlayStation 5 console.\nName: /r/xboxone | Followers: 2,500,000 | Platform: Reddit | Description: The community for the Xbox One console and its games.\nName: /r/ShouldIbuythisgame | Followers: 1,500,000 | Platform: Reddit | Description: A place to ask for advice on whether to purchase a specific video game.\nName: /r/leagueoflegends | Followers: 699,793 | Platform: Reddit | Description: Discussion for League of Legends (r/gaming Wiki: Gaming Subreddits category).\nName: /r/Games | Followers: 621,133 | Platform: Reddit | Description: Discussion for Games (r/gaming Wiki: Gaming Subreddits category).\nName: /r/GamingLeaksAndRumours | Followers: 534,000 | Platform: Reddit | Description: Central hub for all gaming leaks and rumors across all systems.\nName: /r/pokemon | Followers: 444,468 | Platform: Reddit | Description: Discussion for Pokémon (r/gaming Wiki: Gaming Subreddits category).\nName: /r/Minecraft | Followers: 440,180 | Platform: Reddit | Description: Discussion for Minecraft (r/gaming Wiki: Gaming Subreddits category).\nName: /r/FreeGameFindings | Followers: 400,000 | Platform: Reddit | Description: Dedicated to finding and sharing free game promotions and giveaways from all platforms.\nName: /r/gamingsuggestions | Followers: 330,000 | Platform: Reddit | Description: Community for recommending and requesting game suggestions.\nName: /r/GameDeals | Followers: 316,294 | Platform: Reddit | Description: Discussion for Game Deals (r/gaming Wiki: Gaming Subreddits category).\nName: /r/skyrim | Followers: 298,865 | Platform: Reddit | Description: Discussion for The Elder Scrolls V: Skyrim (r/gaming Wiki: Gaming Subreddits category).",
        "platform_breakdown": "Reddit: 997",
        "key_insights": "The research identified a total of 997 distinct gaming subreddits, demonstrating the vast and fragmented nature of the Reddit gaming community. The largest communities are general and platform-specific, such as /r/gaming (47M) and /r/NintendoSwitch (6M), which serve as central hubs. Crucially, the search successfully pinpointed niche communities dedicated to specific user needs, including /r/GamingLeaksAndRumours, /r/FreeGameFindings, and /r/gamingsuggestions, fulfilling all required categories. The majority of the identified subreddits are dedicated to specific games or franchises, highlighting the depth of community engagement for individual titles."
      },
      "error": ""
    },
    {
      "input": "General News Outlets and Channels - Find all major news outlets including broadcast networks, cable channels, newspapers, digital publishers, international outlets, and specialized news",
      "output": {
        "topic_category": "General News Outlets and Channels",
        "total_sources_found": 31,
        "top_sources": "Name: Reuters, Follower Count: N/A (Primarily B2B/Wire Service), Platform: Wire Service, Website, Description: Global news agency providing fast, accurate, and neutral news, data, and images to other media outlets\nName: The New York Times, Follower Count: 564M site visits (May 2025), 11M+ digital subscribers, Platform: Print, Website, App, Vertical Products (Games, Cooking), Description: Major US newspaper and digital publisher, known for high-quality journalism, with a large focus on digital subscriptions\nName: CNN, Follower Count: 434M global visits (May 2025), Platform: TV, Website, App, Streaming, Description: Global 24-hour news network, known for breaking news and extensive international coverage\nName: BBC News, Follower Count: 434M visits (May 2025), Platform: TV, Radio, Website, App, Social Media, Description: Publicly funded global news service, known for balanced and in-depth reporting across various topics\nName: The Guardian, Follower Count: 284M visits (May 2025), Platform: Print, Website, App, Description: UK-based global news outlet, known for in-depth reporting on politics, climate, and social issues\nName: Fox News, Follower Count: 206M visits (FoxNews.com), Platform: TV, Website, App, Description: Most-watched cable news network in the U.S., with a clear conservative angle and growing digital side\nName: Associated Press (AP), Follower Count: 100M+ visits/month (APNews.com), reaches 4B people daily, Platform: Wire Service, Website, App, Description: Non-profit global news agency, providing accurate, reliable news to thousands of media companies worldwide",
        "platform_breakdown": "Broadcast/Streaming: 13, Website/App: 42, Other: 10, Social/Video: 7, Print: 5, Wire Service: 2, Specialized Terminal: 1",
        "key_insights": "The research reveals a clear shift in major news consumption, with digital platforms (Websites and Apps) being the primary channel for most outlets, often exceeding traditional broadcast reach. Global news agencies like Reuters and AP, while not having the highest direct site traffic, maintain immense influence by supplying content to billions of people daily through their wire services. Furthermore, specialized outlets like PCMag and Bloomberg demonstrate that a focused editorial niche can still command significant monthly visits and a dedicated audience."
      },
      "error": ""
    },
    {
      "input": "Gaming History Channels and TV Shows - Find all major YouTube channels and TV shows focused on gaming history, documentaries, retro gaming, and the cultural impact of video games",
      "output": {
        "topic_category": "Gaming History Channels and TV Shows",
        "total_sources_found": 9,
        "top_sources": "Gaming Historian | ~1.09 Million | YouTube | Documentary series on the history of video games, known for high-quality, in-depth historical dives.\nMetalJesusRocks | ~944K | YouTube | Focuses on retro gaming, game collecting, and reviews, often touching on the history and cultural significance of older games.\nNoclip | ~885K | YouTube | Crowdfunded video game documentaries focusing on the behind-the-scenes stories of game development and the cultural impact of games.\nHigh Score | N/A | Netflix (Docuseries) | A 2020 docuseries that traces the history of classic video games, featuring interviews with the innovators who brought them to life.\nConsole Wars | N/A | Documentary Film | A 2020 documentary film detailing the 1990s rivalry between Sega and Nintendo, focusing on the business and cultural impact.",
        "platform_breakdown": "YouTube: 6, Netflix: 1, Documentary Film: 2",
        "key_insights": "The research reveals a strong presence of high-quality, long-form video content dedicated to gaming history, with YouTube being the dominant platform for independent creators like Gaming Historian and Noclip. A clear distinction exists between channels focused on in-depth historical documentaries (Gaming Historian, Noclip) and those centered on retro game collecting and reviews (MetalJesusRocks, Game Sack), all contributing to the preservation of gaming culture. Furthermore, major streaming services like Netflix have invested in high-production docuseries such as \"High Score\" and \"Console Wars,\" validating the mainstream appeal and cultural significance of video game history."
      },
      "error": ""
    }
  ]
}